# Terraform environment tt02
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_client_config.hub: Reading...
module.postgres_server.data.azurerm_virtual_network.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.postgres_server.data.azurerm_virtual_network.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.spoke: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.hub: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTE5ZGQ3ZjUxLWIzZjAtNDVkMS1hNDkyLTFmOTc2MzEzOWU1NTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.default: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTE5ZGQ3ZjUxLWIzZjAtNDVkMS1hNDkyLTFmOTc2MzEzOWU1NTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_user_assigned_identity.admin: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.postgres_server.data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTE5ZGQ3ZjUxLWIzZjAtNDVkMS1hNDkyLTFmOTc2MzEzOWU1NTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.postgres: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_storage_account.use_lease[0]: Reading...
data.azurerm_subnet.default: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001tt02/subnets/Default]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_storage_account.use_lease[0]: Reading...
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001tt02]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_subnet.postgres: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001tt02/subnets/Postgres]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 3s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001tt02]
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_storage_account.use_lease[0]: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthaccessmgmt001tt02]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 3s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 4s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 4s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 3s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthaccessmgmt001tt02/providers/Microsoft.KeyVault/vaults/kvacmaltinnauth001tt02"
      + name                    = "db-psqlsrvaltinnauthaccessmgmt001tt02-accessmgmt-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthaccessmgmt001tt02/providers/Microsoft.KeyVault/vaults/kvacmaltinnauth001tt02"
      + name                    = "db-psqlsrvaltinnauthaccessmgmt001tt02-accessmgmt-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "6959329184442965922" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-06-24T13:18:47Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_feature.configuration["AccessManagement.HostedServices.ResourceRegisterSync_tt02-access-management"] will be destroyed
  # (because key ["AccessManagement.HostedServices.ResourceRegisterSync_tt02-access-management"] is not in for_each map)
  - resource "azurerm_app_configuration_feature" "configuration" {
      - configuration_store_id  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - description             = "Specifies if the resource register data should streamed from resource register service to access management database" -> null
      - enabled                 = false -> null
      - id                      = "https://appconfaltinnauth001hub.azconfig.io/kv/.appconfig.featureflag%2FAccessManagement.HostedServices.ResourceRegisterSync?label=tt02-access-management" -> null
      - key                     = "AccessManagement.HostedServices.ResourceRegisterSync" -> null
      - label                   = "tt02-access-management" -> null
      - locked                  = false -> null
      - name                    = "AccessManagement.HostedServices.ResourceRegisterSync" -> null
      - percentage_filter_value = 0 -> null
    }

  # module.appsettings.azurerm_app_configuration_feature.configuration["AccessManagement.HostedServices.ResourceRegistrySync_tt02-access-management"] will be created
  + resource "azurerm_app_configuration_feature" "configuration" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + description            = "Specifies if the resource register data should streamed from resource register service to access management database"
      + enabled                = false
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "AccessManagement.HostedServices.ResourceRegistrySync"
      + label                  = "tt02-access-management"
      + locked                 = false
      + name                   = "AccessManagement.HostedServices.ResourceRegistrySync"
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Database:Postgres:AppConnectionString_tt02-access-management"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Database:Postgres:AppConnectionString?label=tt02-access-management"
        tags                   = {}
      ~ vault_key_reference    = "https://kvacmaltinnauth001tt02.vault.azure.net/secrets/db-psqlsrvaltinnauthaccessmgmt001tt02-accessmgmt-app" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Database:Postgres:MigrationConnectionString_tt02-access-management"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Database:Postgres:MigrationConnectionString?label=tt02-access-management"
        tags                   = {}
      ~ vault_key_reference    = "https://kvacmaltinnauth001tt02.vault.azure.net/secrets/db-psqlsrvaltinnauthaccessmgmt001tt02-accessmgmt-migrator" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthaccessmgmt001tt02/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthaccessmgmt001tt02"
        name                              = "psqlsrvaltinnauthaccessmgmt001tt02"
      ~ sku_name                          = "GP_Standard_D2s_v3" -> "GP_Standard_D2ads_v5"
      ~ storage_tier                      = "P4" -> "P10"
        tags                              = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2025-06-24T13:17:38Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @Alxandr |
| Action | `push` |
| Working Directory | `src/apps/Altinn.AccessManagement/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/tt02/altinn.accessmanagement.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_tt02_altinn.accessmanagement.tfstate.tfplan`